icssw-org/MeshCom-Firmware/src/nrf52/nrf52_functions.cpp
// (C) 2023 OE1KBC Kurt Baumann, OE1KFR Rainer 
// (C) 2016, 2017, 2018, 2018, 2019, 2020 OE1KBC Kurt Baumann
//
// 20230326: Version 4.00: START

#include <Arduino.h>
#include <configuration.h>

#include <loop_functions.h>
#include <loop_functions_extern.h>
#include <lora_setchip.h>

#include <nrf52_functions.h>

#if MC_HAS_U8G2   // GRD-01: war dieselbe Aussage ohne die ESP32-Boards

#include <U8g2lib.h>

extern U8G2 *u8g2;
extern U8G2 u8g2_1;
extern U8G2 u8g2_2;

void initDisplay()
{
    Serial.println(F("[INIT]...Auto detecting display:"));
        
    int idtype = esp32_isSSD1306(0x3C);

    // DISP-01, 2026-09-17: HIER lag der Fehler. Diese Kopie bildete idtype 1
    // auf u8g2_2 (SH1106) ab, die ESP32-Kopie auf u8g2_1 (SSD1306) -- bei
    // derselben Sonde. Auf der Bench ist ESP32 belegt (Heltec V3 und ein
    // T-Beam stellen beide sauber dar), also war diese Seite verdreht: ein
    // 0,9"-SSD1306-Panel bekam den SH1106-Treiber und damit zwei Spalten
    // Versatz. Betroffen ist allein ein RAK4631 MIT RAK1921-OLED; der
    // Bench-RAK hat keins ("Display not found"), der Fehler war hier also
    // latent und ist NICHT auf Hardware nachgewiesen.
    //
    // Beide Plattformen benutzen jetzt dieselbe Zuordnung.

    u8g2 = mcSelectU8g2(idtype);

    if(u8g2 == NULL)
    {
        bDisplayOff = true;
        return;
    }

    u8g2->begin();
}

void startDisplay(char line1[20], char line2[20], char line3[20])
{
    char cvers[20];

    if(u8g2 == NULL)
        return;

    u8g2->clearDisplay();
    oledInvalidate();
    u8g2->setFont(u8g2_font_6x10_mf);
    u8g2->firstPage();
    do
    {
        u8g2->setFont(u8g2_font_10x20_mf);
        u8g2->drawStr(5, 15, "MeshCom 4.0");
        u8g2->setFont(u8g2_font_6x10_mf);
        snprintf(cvers, sizeof(cvers), "FW %s/%s <%s>", SOURCE_VERSION, SOURCE_VERSION_SUB, getCountry(meshcom_settings.node_country).c_str());
        u8g2->drawStr(5, 25, cvers);
        u8g2->drawStr(5, 35, line1);
        u8g2->drawStr(5, 45, line2);
        u8g2->drawStr(5, 55, line3);
    } while (u8g2->nextPage());
}
#endif

#if defined(BOARD_T_ECHO)

#include <SPI.h>
#include <Wire.h>

#include "t_echo_utilities.h"
#include "t_echo_images.h"

//Libraries for E-paper Display
#include <GxEPD.h>
#include <GxDEPG0150BN/GxDEPG0150BN.h>  // 1.54" b/w
#include GxEPD_BitmapExamples
#include <Fonts/FreeMonoBold9pt7b.h>
#include <Fonts/FreeMonoBold12pt7b.h>
#include <Fonts/FreeMonoBold18pt7b.h>
#include <Fonts/FreeMonoBold24pt7b.h>
#include <GxIO/GxIO_SPI/GxIO_SPI.h>
#include <GxIO/GxIO.h>

extern SPIClass dispPort;

extern GxIO_Class io;
extern GxEPD_Class epaper_display;

void enableBacklight(bool en)
{
    digitalWrite(ePaper_Backlight, en);
}

void LilyGo_logo(void)
{
    epaper_display.setRotation(2);
    epaper_display.fillScreen(GxEPD_WHITE);

    epaper_display.drawExampleBitmap(BitmapCallSign, 0, 0, GxEPD_WIDTH, GxEPD_HEIGHT, GxEPD_BLACK);
    epaper_display.update();
}

void Veille_logo(void)
{
    epaper_display.setRotation(0);
    epaper_display.fillScreen(GxEPD_WHITE);
    epaper_display.drawExampleBitmap(T_Echo_OFF, 0, 0, GxEPD_WIDTH, GxEPD_HEIGHT, GxEPD_BLACK);
    epaper_display.setRotation(3);
    epaper_display.update();
}

void Batterie_Vide_logo(void)
{
    epaper_display.setRotation(0);
    epaper_display.fillScreen(GxEPD_WHITE);
    epaper_display.drawExampleBitmap(Batterie_Vide, 0, 0, GxEPD_WIDTH, GxEPD_HEIGHT, GxEPD_BLACK);
    epaper_display.setRotation(3);
    epaper_display.update();
}

void MeshCom_Image(void)
{
    epaper_display.fillScreen(GxEPD_WHITE);
    epaper_display.update();

    epaper_display.setRotation(0);
    epaper_display.drawExampleBitmap(MeshCom_BitMap, 0, 0, GxEPD_WIDTH, GxEPD_HEIGHT, GxEPD_BLACK);
    epaper_display.setRotation(3);
    epaper_display.update();
}

extern bool bDEEP_SLEEP;

void boardPWROff()
{
    // Issue 962 (docs/issue-962-deepsleep-verdict.md, section 6.4): real
    // nRF52 System OFF now lives in nrf52_sleep.cpp and covers everything
    // this function used to do by hand (Batterie_Vide_logo(), Power_On_Pin
    // LOW) plus radio sleep, BLE advertising stop, bus teardown and a real
    // wake-armed sleep instead of the old bDEEP_SLEEP/delay(60000) soft-off.
    extern void nrf52EnterDeepSleep();
    nrf52EnterDeepSleep();
}

void boardInit()
{
    dispPort.begin();

    /*
    uint32_t reset_reason;
    sd_power_reset_reason_get(&reset_reason);
    SerialMon.print("sd_power_reset_reason_get:");
    SerialMon.println(reset_reason, HEX);
    */

    pinMode(Power_Enable_Pin, OUTPUT);
    digitalWrite(Power_Enable_Pin, HIGH);
    //Pwr_en = true;

    pinMode(Power_On_Pin, OUTPUT);
    digitalWrite(Power_On_Pin, HIGH);
    //Pwr_on = true;

    pinMode(ePaper_Backlight, OUTPUT);

    pinMode(GreenLed_Pin, OUTPUT);
    pinMode(RedLed_Pin, OUTPUT);
    pinMode(BlueLed_Pin, OUTPUT);

    pinMode(UserButton_Pin, INPUT_PULLUP);
    pinMode(Touch_Pin, INPUT_PULLUP);
}

void initDisplay()
{
    Serial.println("[DISP]...board init");

    boardInit();

    Serial.println("[DISP]...setup Display");

    epaper_display.update();
    delay(500);

    epaper_display.init(/*115200*/); // enable diagnostic output on Serial
    epaper_display.setTextColor(GxEPD_BLACK);
    epaper_display.setFont(&FreeMonoBold9pt7b);

    MeshCom_Image();

    delay(4000);

    enableBacklight(false);

    epaper_display.update();
}

void startDisplay(char line1[20], char line2[20], char line3[20])
{
    char cvers[20];

    snprintf(cvers, sizeof(cvers), "%s/%-1.1s %s", SOURCE_VERSION, SOURCE_VERSION_SUB, getCountry(meshcom_settings.node_country).c_str());

    Serial.println("[DISP]...start");

    epaper_display.fillScreen(GxEPD_WHITE);
    epaper_display.setCursor(5, 20);
    epaper_display.printf("MeshCom\n");

    epaper_display.setCursor(5, 40);
    epaper_display.printf("v%s\n", cvers);

    epaper_display.setCursor(5, 60);
    epaper_display.printf("%s\n%s\n", __DATE__ , __TIME__);

    epaper_display.setCursor(5, 120);
    epaper_display.printf("%s\n", line1);

    epaper_display.setCursor(5, 140);
    epaper_display.printf("%s\n", line2);

    epaper_display.setCursor(5, 160);
    epaper_display.printf("%s\n", line3);

    epaper_display.update();
}

#endif
